Revit 2027 API
BuiltInFailures.GeometryFailures.OffsetFaceFailed Property
 Failed to offset the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OffsetFaceFailed { get; }
Public Shared ReadOnly Property OffsetFaceFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OffsetFaceFailed {
	FailureDefinitionId^ get ();
}
static member OffsetFaceFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace